---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType
source: html/f02d8d2d-735a-30d3-2a94-5ca37d8c05d0.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType

ConceptualConstructionType values for Walls.

## Syntax (C#)
```csharp
public enum ConceptualConstructionWallType
```